Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [10]:
import pandas as pd
series=pd.Series([4,8,15,16,23,42])
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [27]:
lst=[1,2,3,4,5,6,7,8,9,10]
pd.Series(lst)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [25]:
data={
    'Name':['Alice','Bob','Claire'],
    'Age' : [25,30,27],
    'Gender':['Female','Male','Female']
}
df=pd.DataFrame(data)
df.set_index('Name')

        Age  Gender
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

 DataFrame is a two-dimensional labeled data structure that consists of columns of different types. It is similar to a table or spreadsheet in which data is organized in rows and columns. Each column in a DataFrame is a pandas Series, and together they form a DataFrame.
 A DataFrame allows for more complex data manipulation and analysis compared to a Series because it can store multiple columns of data and supports various operations such as indexing, merging, grouping, and reshaping. It provides a convenient way to work with structured data and perform data analysis tasks.
  Series series that contains a sequence of integers. It is a one-dimensional labeled array where each element has an index.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [32]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 28, 32],
    'City': ['New York', 'London', 'Paris', 'Sydney', 'Tokyo']
}
df = pd.DataFrame(data)

# Displaying the first few rows of the DataFram
print(df.head())

# Displaying summary information about the DataFrame
df.info()

# Generating descriptive statistics of numerical columns
df.describe()

# Counting the frequency of values in the 'City' column
df['City'].value_counts()

# Grouping data by 'City' and calculating the mean age for each city
grouped_df = df.groupby('City')['Age'].mean()
grouped_df

      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   28    Sydney
4      Eve   32     Tokyo
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   City    5 non-null      object
dtypes: int64(1), object(2)
memory usage: 248.0+ bytes

City
London      30.0
New York    25.0
Paris       35.0
Sydney      28.0
Tokyo       32.0
Name: Age, dtype: float64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In pandas, both Series and DataFrame are mutable in nature, while Panel is immutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [29]:
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
data = {
    'Name': name_series,
    'Age': age_series
}
df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35